# GetSourceId Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
IDirectContext3DServer..::..GetSourceId Method
IDirectContext3DServer Interface See Also
---
Reports this server's source ID.
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
string GetSourceId()
```

Visual Basic
---
```text
Function GetSourceId As String
```

Visual C++
---
```text
String^ GetSourceId()
```

# ### Return Value
The source ID.
# See Also
IDirectContext3DServer Interface
Autodesk.Revit.DB.DirectContext3D Namespace